blogs/trouble-shooting-redis-replication-lag.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-16 Thu 13:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>排查redis主从复制lag不断增大问题</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">排查redis主从复制lag不断增大问题</h1>
<p>
redis以主从模式部署时，监控主从是否同步非常重要。我们在master执行 <code>info replication</code> 命令并监控 <code>slave#</code> 的值。 <code>slave#</code>的值类似这种 <code>ip=10.14.11.12,port=6379,state=online,offset=4878516094,lag=0</code> 通过检查lag的值是否超过阈值来判断主从是否同步。
</p>

<p>
老实说，监控lag纯属望文生义，对它的含义并不是十分理解。直到有一天某个实例的lag不断增长，大于60后主从连接自动断开。从lag上看，主从不同步了，但从实际效果看（主写入后，马上可以在从上读出来）主从并没有不同步。
</p>

<p>
排查过程比较曲折，记录下排查过程：
</p>

<div id="outline-container-org489b418" class="outline-2">
<h2 id="org489b418"><span class="section-number-2">1</span> 肤浅阶段</h2>
<div class="outline-text-2" id="text-1">
<p>
之所以说肤浅，是因为没下功夫。查看机器的负载，网络连接正常。查看redis的slowlog正常。然后开始在网络上搜索，也没有结果。网络搜索通常是很好的主意，但是如果搜索了20分钟，还没有结果，也许该暂停下，想想是不是搜索方向出了问题，抑或是看看源码。
</p>
</div>
</div>

<div id="outline-container-org5bdd301" class="outline-2">
<h2 id="org5bdd301"><span class="section-number-2">2</span> lag 到底是何方神圣</h2>
<div class="outline-text-2" id="text-2">
<p>
grep -w lag . 发现 server.c 文件
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #00ffff; font-weight: bold;">if</span> (slave-&gt;replstate == SLAVE_STATE_ONLINE)
  lag = time(<span style="color: #ff00ff;">NULL</span>) - slave-&gt;repl_ack_time;

info = sdscatprintf(info,
    <span style="color: #00ff00;">"slave%d:ip=%s,port=%d,state=%s,offset=%lld,lag=%ld\r\n"</span>,
    slaveid,slaveip,slave-&gt;slave_listening_port,state,
    slave-&gt;repl_ack_off, lag);
</pre>
</div>

<p>
由此看出lag和 <code>repl_ack_time</code> 有关，继续grep发现 replication.c
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #00ffff; font-weight: bold;">if</span> (!strcasecmp(c-&gt;argv[j]-&gt;ptr,<span style="color: #00ff00;">"ack"</span>)) {
  <span style="color: #00ff00;">long</span> <span style="color: #00ff00;">long</span> <span style="color: #ffff00;">offset</span>;
  <span style="color: #00ffff; font-weight: bold;">if</span> ((getLongLongFromObject(c-&gt;argv[j+1], &amp;offset) != C_OK))
    <span style="color: #00ffff; font-weight: bold;">return</span>;
  <span style="color: #00ffff; font-weight: bold;">if</span> (offset &gt; c-&gt;repl_ack_off)
    c-&gt;repl_ack_off = offset;
  c-&gt;repl_ack_time = server.unixtime;
}
</pre>
</div>
<p>
slave会发送 <code>ACK</code> 给master，汇报自己的offset，每收到 <code>ACK</code> master都会更新 <code>repl_ack_time</code> 和 <code>repl_ack_off</code> 。
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #00ffff; font-weight: bold;">if</span> ((server.unixtime - slave-&gt;repl_ack_time) &gt; server.repl_timeout)
{
  serverLog(LL_WARNING, <span style="color: #00ff00;">"Disconnecting timedout replica: %s"</span>,
    replicationGetSlaveName(slave));
  freeClient(slave);
}
</pre>
</div>
<p>
如果超过 <code>repl_timeout</code> 没收到 <code>ACK</code> ，master会主动断开和slave的连接。这和观察到的现象一致。
</p>

<p>
综上大致可以推测出，因为master没有收到 <code>ACK</code> 的缘故，导致主从表现为不同步。
</p>
</div>
</div>

<div id="outline-container-orga241ee1" class="outline-2">
<h2 id="orga241ee1"><span class="section-number-2">3</span> slave 为啥不发ACK</h2>
<div class="outline-text-2" id="text-3">
<p>
首先要确定slave是否发了ACK，在replication.c中
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">replicationCron</span>(<span style="color: #00ff00;">void</span>) {
  <span style="color: #00ffff; font-weight: bold;">if</span> (server.masterhost &amp;&amp; server.master &amp;&amp;
      !(server.master-&gt;flags &amp; CLIENT_PRE_PSYNC))
    replicationSendAck();
}
</pre>
</div>
<p>
因为slave上没有业务，直接用gdb设置了两个断点 <code>replicationCron</code> 和 <code>replicationSendAck</code> ，前者执行了，但是后者没有执行，的确没有发送 <code>ACK</code> 。
</p>

<p>
为了确定slave不发<code>ACK</code> ，是master还是slave导致的。我新启了另外的slave，lag没有问题，可以确定是slave的原因导致的。考虑没有配置控制这个行为，我估计是代码bug，slave内部状态错了。这个代码太复杂了，一时半会儿理不出头绪，遂放弃。
</p>
</div>
</div>

<div id="outline-container-orgaf8ea0c" class="outline-2">
<h2 id="orgaf8ea0c"><span class="section-number-2">4</span> 如何修复</h2>
<div class="outline-text-2" id="text-4">
<p>
内部状态坏了，可以通过重启解决。还有一个不重启的方法： <code>slaveof NO ONE; flushall; slaveof master port</code> ，中间 <code>flushall</code> 命令是必须的。
</p>
</div>
</div>

<div id="outline-container-orgf39a80c" class="outline-2">
<h2 id="orgf39a80c"><span class="section-number-2">5</span> 总结</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>监控主从同步可以从lag和offset两个维度，lag值小于某个数， <code>slave_repl_offset - offset</code> 的值也小于某个数</li>
<li>看源码很多时候往往是捷径。</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2020-01-16 Thu 13:08</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
